In [15]:
import numpy as np 
import pandas as pd

In [3]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
s1.values

array([1, 2, 3, 4])

In [7]:
s2 = pd.Series([1,2,3,4], index=list("abcd"))
s2

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
s2[0]

C:\Users\Admin\AppData\Local\Temp\ipykernel_20000\2344841457.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0]

np.int64(1)

In [10]:
s2['a']

np.int64(1)

In [11]:
df1 = pd.DataFrame({'name':['Long','Mai'],
                    'Scores':[9,7]})
df1

   name  Scores
0  Long       9
1   Mai       7

In [12]:
type(df1)

pandas.core.frame.DataFrame

In [13]:
type(s1)

pandas.core.series.Series

In [16]:
df2 = pd.DataFrame(data=np.arange(1,7).reshape(2,3), 
                   index=['row1','row2'],
                   columns=['col1','col2','col3'])
df2

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [17]:
df2['col1']

row1    1
row2    4
Name: col1, dtype: int64

In [18]:
df2[['col1','col3']]

      col1  col3
row1     1     3
row2     4     6

In [21]:
df2['col1']

row1    1
row2    4
Name: col1, dtype: int64

In [20]:
df2

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [19]:
df2.iloc[0]

col1    1
col2    2
col3    3
Name: row1, dtype: int64

In [22]:
df2.loc['row2']

col1    4
col2    5
col3    6
Name: row2, dtype: int64